import numpy as np

"""蜗杆"""
# 蜗杆头数Z1
Z1 = 1

# 模数m
m = 0.5

# 蜗杆直径系数q
q = 10

# 蜗杆分度圆直径d1
d1 = m * q

# 蜗杆齿顶高ha1
ha1 = 1 * m

# 蜗杆齿顶圆直径d_a1
da1 = d1 + 2 * ha1

# 蜗杆齿根高hf1
hf1 = 1.2 * m

# 蜗杆齿根圆直径d_f1
df1 = d1 - 2 * hf1

# 蜗杆分度圆柱导程角λ
lambda_radians = np.arctan(Z1 / q)
lambda_degrees = np.rad2deg(lambda_radians)

# 齿形角α
alpha = 20

# 蜗杆导程Pz
Pz = np.pi * m * Z1

# 蜗杆轴向齿距pa
pa = np.pi * m

# 蜗杆轴向齿厚Sa
Sa = 0.5 * np.pi * m

# 蜗轮齿数Z2
Z2 = 10

# 蜗杆螺纹部分长度L(图中的b1尺寸)，变位系数ξ=0时，L≥(11 + 0.06*Z2)*m
L = (11 + 0.06 * Z2) * m
print(f"蜗杆螺纹部分长度L = {L:.2f}")
# # 蜗杆螺纹部分长度L
# L = 6

# 蜗杆齿根圆半径ρf
rf = 0.3 * m

"""蜗轮刀具"""
# 蜗轮齿数
# Z2上面已经定义

# 模数
# m上面已经定义

# 蜗轮分度圆直径d2
d2 = m * Z2

# 压力角α
# alpha上面已经定义

# 涡轮基圆直径db
db = d2 * np.cos(np.deg2rad(alpha))

# 蜗轮每个齿对应的角度φ
phi = 360 / Z2

"""Worm Gear"""
print("\n---Worm Gear---")
# 蜗轮变位系数xi
xi = 0
# 蜗轮齿顶高ha2
ha2 = (1 + xi) * m
# 蜗轮齿顶圆直径d_a2
da2 = d2 + 2 * ha2
# 蜗轮齿根高hf2
hf2 = (1.2 - xi) * m
# 蜗轮齿根圆直径d_f2
df2 = d2 - 2 * hf2
print(f"齿根圆直径df2 {df2:.2f}")
# 蜗轮外径d_e2
de2 = da2 + 2 * m
# 蜗杆分度圆直径d1
# d1上面已经定义
# 蜗轮齿顶圆弧半径R
R = d1 / 2 - m
# 蜗杆齿顶圆直径d_a1
# d_a1上面已经定义
# 蜗轮宽度B
B = 0.75 * da1
# 蜗轮面角2*gamma
gamma = 50

"""Spiral"""

# 蜗杆头数Z1
# Z1上面已经定义

# 蜗杆导程Pz
# Pz上面已经定义


print("---Worm---")
print("1、先建立一个基体圆柱"
      f"\n    -直径{da1:.2f}"
      f"\n    -长度要大于{L:.2f}！！！"
      "\n2、建立齿廓曲线"
      f"\n    -呈现倒梯形（蜗杆的齿是扣掉的部分）"
      f"\n    -垂直于基体圆柱底面"
      f"\n    -齿厚{Sa:.2f}平行于上下底，这条线对应分度圆的位置后面应把它对齐到分度圆位置上（注意：基体为齿顶圆柱）"
      f"\n    -齿根高{hf1:.2f}：齿厚线到下底的距离"
      f"\n    -齿顶高{ha1:.2f}：齿厚线到上底的距离"
      f"\n    -左右边经过齿厚线端点，且与梯形高方向夹角{alpha:.2f}°"
      f"\n    -下底两个角倒角半径{0.3*m:.2f}"
      f"\n    -连接成封闭曲线"
      "\n3、建立螺旋线"
      f"\n    -起点终点与基体圆柱对齐（如果基体圆柱够长）"
      f"\n    -直径{d1:.2f}"
      f"\n    -螺距{Pz:.2f}"
      "\n4、旋转扫掠"
      "\n    -caps为封闭实体"
      "\n5、布尔差集"
      "\n    -非流形边缘可能导致差集失败，通过缩小基体直径（多少误差都行，只要柱面不与扫掠实体的侧面重合）")

print("\n---Worm Knife---")
print("1、先建立三个圆"
      f"\n    -基圆：直径{db:.2f}"
      f"\n    -分度圆：直径{d2:.2f}"
      f"\n    -外圆：直径大于齿顶圆直径——{da2:.2f}"
      "\n2、建立渐开线1"
      "\n    -找到渐开线1与的分度圆的交点"
      f"\n    -画镜像轴直线，距离交点夹角为{phi/4:.2f}，位置与渐开线走向相反"
      "\n    -镜像得到渐开线2"
      "\n2、切割基圆、渐开线12、外圆曲线、分度圆曲线（在轮廓中间，用于对齐），得到刀具")

print("\n---Spiral---")
print("1、建立蜗轮基体横截面"
      "\n    -边缘呈双驼峰状"
      f"\n    -涡轮厚度（双驼峰横向距离）为{B:.2f}"
      f"\n    -峰谷为圆弧，半径为{R:.2f}"
      f"\n    -圆弧底到基体中心距离为{da2/2:.2f}"
      "\n    -峰顶为平面"
      f"\n    -驼峰顶到基体中心距离为{de2/2:.2f}，驼峰顶直线与圆弧交与一点"
      f"\n    -驼峰底到基体中心连线与驼峰外边（直线）夹角为{gamma:.2f}，此外边直线与驼峰顶直线交与另一点，两点决定了驼峰顶宽度"
      "\n2、旋转成体"
      f"\n    -标记出基圆直线在基体横截面位置的直线（距基体中心{d2/2:.2f}）"
      "\n3、建立螺旋线，切割出轮齿"
      f"\n    -直径为{d1:.2f}，实际上是蜗杆的分度圆，将其端点对齐到蜗轮分度圆直线上"
      f"\n    -螺距为{Pz:.2f}"
      "\n    -长度略超出基体范围"
      f"\n    -将刀具的分度圆曲线对齐到螺旋线驼峰底上"
      "\n4、扫掠并布尔差值"
      "\n    -将螺旋线分为两半，分别扫掠，再加盖并并集")
print("\n---装配---"
      f"中心距{(d1+d2)/2:.2f}")

print(f"da2 = {da2:.2f}")
print(f"df2 = {df2:.2f}")